app/controllers/comments_controller.rb

	def create
		comment = @post.comments.create(comment_params.merge(user_id: current_user.id))
---
INSERT INTO "comments" ("body", "created_at", "post_id", "updated_at") VALUES (?, ?, ?, ?)  [["body", "1"], ["created_at", "2015-03-10 13:06:47.399397"], ["post_id", 1], ["updated_at", "2015-03-10 13:06:47.399397"]]

	def upvote
		comment = @post.comments.find(params[:id])
		comment.increment!(:upvotes)
---
SELECT  "comments".* FROM "comments"  WHERE "comments"."post_id" = ? AND "comments"."id" = ? LIMIT 1  [["post_id", 1], ["id", 6]]
UPDATE "comments" SET "updated_at" = ?, "upvotes" = ? WHERE "comments"."id" = 6  [["updated_at", "2015-03-10 13:34:18.751266"], ["upvotes", 1]]