app/controllers/posts_controller.rb

SELECT "posts".* FROM "posts"
---
	def index
		respond_with Post.all

INSERT INTO "posts" ("created_at", "title", "updated_at", "user_id") VALUES (?, ?, ?, ?)  [["created_at", "2015-03-10 16:02:36.358774"], ["title", "listo pues?"], ["updated_at", "2015-03-10 16:02:36.358774"], ["user_id", 1]]
---
	def create
		respond_with Post.create(post_params.merge(user_id: current_user.id))

SELECT  "posts".* FROM "posts"  WHERE "posts"."id" = ? LIMIT 1  [["id", 1]]
---
	def show
		respond_with Post.find(params[:id])

SELECT  "posts".* FROM "posts"  WHERE "posts"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "posts" SET "updated_at" = ?, "upvotes" = ? WHERE "posts"."id" = 1  [["updated_at", "2015-03-09 20:36:29.775039"], ["upvotes", 1]]
---
	def upvote
		post = Post.find(params[:id])
		post.increment!(:upvotes)